In [2]:
import pandas as pd

# Create a new DataFrame
data = {
    'Name': ['John', 'Jane', 'Bob', 'Alice'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Miami']
}

df = pd.DataFrame(data)
df

    Name  Age         City
0   John   25     New York
1   Jane   30  Los Angeles
2    Bob   35      Chicago
3  Alice   40        Miami

In [3]:
import mysql.connector
import pandas as pd